In [1]:
## all imports
from IPython.display import HTML
import urllib2
import bs4              # this is beautiful soup
import time
import operator
import socket
import cPickle          # this is to save objects in pickle format
import re               # regular expressions

import numpy as np

import pandas as pd
from pandas import Series
from pandas import DataFrame

import matplotlib
import matplotlib.pyplot as plt
%matplotlib inline

import seaborn as sns
sns.set_context("talk")
sns.set_style("white")

In [2]:
print "Hello World"

Hello World

In [3]:
print "I love python"

I love python

In [4]:
a= np.zeros(4)
a

array([ 0.,  0.,  0.,  0.])

In [5]:
len(a)

4

In [6]:
a.clip?

In [8]:
u_cols= ['user_id', 'age', 'sex', 'occupation', 'zip_code']

In [9]:
print u_cols

['user_id', 'age', 'sex', 'occupation', 'zip_code']

In [10]:
users= pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.user',
                  sep= '|',
                  names= u_cols)

In [11]:
users.shape

(943, 5)

In [12]:
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [13]:
r_cols= ['user_id', 'movie_id', 'rating', 'unix_tms']
ratings= pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.data',
                    sep= '\t',
                    names= r_cols)
ratings.head()

   user_id  movie_id  rating   unix_tms
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [14]:
ratings.shape

(100000, 4)

In [17]:
m_cols= ['movie_id', 'title', 'release_dt', 'vid_release_dt', 'imdb_url']
movies= pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.item',
                    sep= '|', 
                    names= m_cols,
                   usecols= range(5))
movies.head()

,movie_id,title,release_dt,vid_release_dt,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

In [18]:
print movies.shape

(1682, 5)

In [20]:
print movies.dtypes

movie_id            int64
title              object
release_dt         object
vid_release_dt    float64
imdb_url           object
dtype: object

In [22]:
movies.describe()    # this only works on numerical columns

          movie_id  vid_release_dt
count  1682.000000               0
mean    841.500000             NaN
std     485.695893             NaN
min       1.000000             NaN
25%     421.250000             NaN
50%     841.500000             NaN
75%    1261.750000             NaN
max    1682.000000             NaN

In [23]:
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [24]:
users['occupation'].head(10)   #this is a series

0       technician
1            other
2           writer
3       technician
4            other
5        executive
6    administrator
7    administrator
8          student
9           lawyer
Name: occupation, dtype: object

In [25]:
mycols= ['occupation', 'sex']
users[mycols].head(7)

      occupation sex
0     technician   M
1          other   F
2         writer   M
3     technician   M
4          other   F
5      executive   M
6  administrator   M

In [26]:
users.iloc[3]

user_id                4
age                   24
sex                    M
occupation    technician
zip_code           43537
Name: 3, dtype: object

In [27]:
users.head(4)

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537

In [28]:
users.ix[3]

user_id                4
age                   24
sex                    M
occupation    technician
zip_code           43537
Name: 3, dtype: object

In [29]:
users.loc[3]

user_id                4
age                   24
sex                    M
occupation    technician
zip_code           43537
Name: 3, dtype: object

In [30]:
oldUsers= users[users['age'] > 25]

In [31]:
oldUsers.head()

   user_id  age sex     occupation zip_code
1        2   53   F          other    94043
4        5   33   F          other    15213
5        6   42   M      executive    98101
6        7   57   M  administrator    91344
7        8   36   M  administrator    05201

In [32]:
oldUsers.shape

(671, 5)

In [34]:
print users[(users['age']== 40) & (users['sex']=='M')]

     user_id  age sex  occupation zip_code
18        19   40   M   librarian    02138
82        83   40   M       other    44133
115      116   40   M  healthcare    97232
199      200   40   M  programmer    93402
283      284   40   M   executive    92629
289      290   40   M    engineer    93550
308      309   40   M   scientist    70802
357      358   40   M    educator    10022
397      398   40   M       other    60008
564      565   40   M     student    55422
646      647   40   M    educator    45810
791      792   40   M  programmer    12205
841      842   40   M      writer    93055
917      918   40   M   scientist    70116

In [63]:
users[(users['sex']=='F') & (users['occupation']=='programmer')]['age'].mean()

32.166666666666664

In [39]:
ratings.head()

   user_id  movie_id  rating   unix_tms
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [40]:
grp= ratings.groupby('user_id')

In [64]:
user_counts= grp.count()
user_counts.head()

         movie_id  rating  unix_tms
user_id
1             272     272       272
2              62      62        62
3              54      54        54
4              24      24        24
5             175     175       175

In [65]:
user_counts.sort('rating', ascending= False, inplace=True)
user_counts.head()

         movie_id  rating  unix_tms
user_id
405           737     737       737
655           685     685       685
13            636     636       636
450           540     540       540
276           518     518       518

In [76]:
mov_grp= ratings.groupby('movie_id')
avgr= mov_grp['rating'].mean()
avgr.head(10)

movie_id
1     3.878319
2     3.206107
3     3.033333
4     3.550239
5     3.302326
6     3.576923
7     3.798469
8     3.995434
9     3.896321
10    3.831461
Name: rating, dtype: float64

In [48]:
mov_grp.count().head(10)

          user_id  rating  unix_tms
movie_id
1             452     452       452
2             131     131       131
3              90      90        90
4             209     209       209
5              86      86        86
6              26      26        26
7             392     392       392
8             219     219       219
9             299     299       299
10             89      89        89

In [49]:
avgr.head()

movie_id
1    3.878319
2    3.206107
3    3.033333
4    3.550239
5    3.302326
Name: rating, dtype: float64

In [50]:
mm= max(avgr)
mm

5.0

In [56]:
mid_max= avgr[avgr==mm]
mid_max

movie_id
814     5
1122    5
1189    5
1201    5
1293    5
1467    5
1500    5
1536    5
1599    5
1653    5
Name: rating, dtype: float64

In [58]:
best_movs= movies.join(mid_max, on= 'movie_id', how= 'inner')

In [59]:
best_movs

,movie_id,title,release_dt,vid_release_dt,imdb_url,rating
813,814,"Great Day in Harlem, A (1994)",01-Jan-1994,NaN,http://us.imdb.com/M/title-exact?Great%20Day%2...,5
1121,1122,They Made Me a Criminal (1939),01-Jan-1939,NaN,http://us.imdb.com/M/title-exact?They%20Made%2...,5
1188,1189,Prefontaine (1997),24-Jan-1997,NaN,http://us.imdb.com/M/title-exact?Prefontaine%2...,5
1200,1201,Marlene Dietrich: Shadow and Light (1996),02-Apr-1996,NaN,http://us.imdb.com/M/title-exact?Marlene%20Die...,5
1292,1293,Star Kid (1997),16-Jan-1998,NaN,http://us.imdb.com/M/title-exact?imdb-title-12...,5
1466,1467,"Saint of Fort Washington, The (1993)",01-Jan-1993,NaN,http://us.imdb.com/M/title-exact?Saint%20of%20...,5
1499,1500,Santa with Muscles (1996),08-Nov-1996,NaN,http://us.imdb.com/M/title-exact?Santa%20with%...,5
1535,1536,Aiqing wansui (1994),22-Jul-1996,NaN,http://us.imdb.com/M/title-exact?Aiqing%20Wans...,5
1598,1599,Someone Else's America (1995),10-May-1996,NaN,http://us.imdb.com/M/title-exact?Someone%20Els...,5
1652,1653,Entertaining Angels: The Dorothy Day Story (1996),27-Sep-1996,NaN,http://us.imdb.com/M/title-exact?Entertaining%...,5

In [60]:
len(best_movs)

10

In [61]:
len(mid_max)

10

In [62]:
mycols= ['movie_id', 'title', 'rating']
best_movs= best_movs[mycols]
best_movs

      movie_id                                              title  rating
813        814                      Great Day in Harlem, A (1994)       5
1121      1122                     They Made Me a Criminal (1939)       5
1188      1189                                 Prefontaine (1997)       5
1200      1201         Marlene Dietrich: Shadow and Light (1996)        5
1292      1293                                    Star Kid (1997)       5
1466      1467               Saint of Fort Washington, The (1993)       5
1499      1500                          Santa with Muscles (1996)       5
1535      1536                               Aiqing wansui (1994)       5
1598      1599                      Someone Else's America (1995)       5
1652      1653  Entertaining Angels: The Dorothy Day Story (1996)       5

In [70]:
good_movies= avgr[avgr==mm].index
good_movies

Int64Index([814, 1122, 1189, 1201, 1293, 1467, 1500, 1536, 1599, 1653], dtype='int64', name=u'movie_id')

In [77]:
movies.head()

,movie_id,title,release_dt,vid_release_dt,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

In [80]:
movies[movies['movie_id'].isin(good_movies)]

,movie_id,title,release_dt,vid_release_dt,imdb_url
813,814,"Great Day in Harlem, A (1994)",01-Jan-1994,NaN,http://us.imdb.com/M/title-exact?Great%20Day%2...
1121,1122,They Made Me a Criminal (1939),01-Jan-1939,NaN,http://us.imdb.com/M/title-exact?They%20Made%2...
1188,1189,Prefontaine (1997),24-Jan-1997,NaN,http://us.imdb.com/M/title-exact?Prefontaine%2...
1200,1201,Marlene Dietrich: Shadow and Light (1996),02-Apr-1996,NaN,http://us.imdb.com/M/title-exact?Marlene%20Die...
1292,1293,Star Kid (1997),16-Jan-1998,NaN,http://us.imdb.com/M/title-exact?imdb-title-12...
1466,1467,"Saint of Fort Washington, The (1993)",01-Jan-1993,NaN,http://us.imdb.com/M/title-exact?Saint%20of%20...
1499,1500,Santa with Muscles (1996),08-Nov-1996,NaN,http://us.imdb.com/M/title-exact?Santa%20with%...
1535,1536,Aiqing wansui (1994),22-Jul-1996,NaN,http://us.imdb.com/M/title-exact?Aiqing%20Wans...
1598,1599,Someone Else's America (1995),10-May-1996,NaN,http://us.imdb.com/M/title-exact?Someone%20Els...
1652,1653,Entertaining Angels: The Dorothy Day Story (1996),27-Sep-1996,NaN,http://us.imdb.com/M/title-exact?Entertaining%...

In [85]:
counts= mov_grp.count()
counts.head()

          user_id  rating  unix_tms
movie_id
1             452     452       452
2             131     131       131
3              90      90        90
4             209     209       209
5              86      86        86

In [86]:
counts.ix[good_movies]

          user_id  rating  unix_tms
movie_id
814             1       1         1
1122            1       1         1
1189            3       3         3
1201            1       1         1
1293            3       3         3
1467            2       2         2
1500            2       2         2
1536            1       1         1
1599            1       1         1
1653            1       1         1

In [87]:
users.groupby('sex').count()

     user_id  age  occupation  zip_code
sex
F        273  273         273       273
M        670  670         670       670

In [91]:
mov_grp['rating'].apply(lambda f: f.mean()).head(10)

movie_id
1     3.878319
2     3.206107
3     3.033333
4     3.550239
5     3.302326
6     3.576923
7     3.798469
8     3.995434
9     3.896321
10    3.831461
Name: rating, dtype: float64

In [93]:
grp= users['sex'].groupby(users['occupation'])
isMaleMajority= grp.apply(lambda x: sum(x=='M') > sum(x=='F'))
isMaleMajority

occupation
administrator     True
artist            True
doctor            True
educator          True
engineer          True
entertainment     True
executive         True
healthcare       False
homemaker        False
lawyer            True
librarian        False
marketing         True
none              True
other             True
programmer        True
retired           True
salesman          True
scientist         True
student           True
technician        True
writer            True
dtype: bool